# Напишите программу, 
# которая принимает на вход число N 
# и выдает набор произведений чисел от 1 до N.

# Пример:

# - пусть N = 4, тогда [ 1, 2,   6,     24 ] 
#                      ( 1, 1*2, 1*2*3, 1*2*3*4)

n = 4

def Sum(n):
    a = []
    for i in range(1, n+1):
        print(i, sep=" ",end=" ")
        if(i < n):
            print("+", sep=" ", end=" ")
        a.append(i)
    print('=',sum(a))

Sum(n)